examples/openfoam_airfoil/airfoil_tuner (copy)/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
224
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
