examples/openfoam_airfoil/airfoil_tuner (copy)/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1402";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
0.224347
0.231442
0.237648
0.243014
0.247614
0.251539
0.254886
0.256648
...
)
;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.327869;
        value           nonuniform List<scalar> 
224
(
0.327869
0.327869
0.327869
0.327869
0.327869
0.327869
0.327869
0.327869
...
)
;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0.327869;
        value           nonuniform List<scalar> 
128
(
0.224347
0.224362
0.224326
0.224371
0.224288
0.22438
0.224236
0.224389
...
)
;
    }
    airfoil
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           nonuniform List<scalar> 
128
(
1.69135e+08
1.73304e+08
1.77475e+08
1.81184e+08
1.84468e+08
1.87363e+08
1.89906e+08
1.92134e+08
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
